In [3]:
from platform import python_version
print(python_version())

3.12.3

In [4]:
# Imports
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm

### Carregando o Data Set

In [5]:
dataset = pd.read_csv('datasetsm.csv')

In [6]:
dataset.shape

(3000, 7)

In [7]:
dataset.head()

   valor_aluguel  area_m2  ...  numero_cozinhas  codigo_bairro
0      120.97436       35  ...                0           1112
1      436.97433      104  ...                0           1112
2      355.74360       29  ...                0           2114
3      282.92310       39  ...                0           2148
4      807.23080       97  ...                0           2222

[5 rows x 7 columns]

### Analise Exploratória

In [9]:
# Verificar se há valores ausentes
dataset.isnull().sum()

valor_aluguel        0
area_m2              0
ano_construcao       0
codigo_localidade    0
numero_banheiros     0
numero_cozinhas      0
codigo_bairro        0
dtype: int64

In [ ]:
# Resumo estatistico do Dataset - ATENÇÃO